In [59]:
import pandas as pd

In [60]:
people = {
    'first' : ['Kamrul','Rezwan','Nazmul'],
    'last' : ['Hasan','karim','Alam'],
    'email' : ['kamrulhasan@gmail.com','rezwanulkarim@gmail.com','nazmulaloam@gmail.com']
}

In [61]:
df = pd.DataFrame(people)

In [62]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam    nazmulaloam@gmail.com

In [63]:
filt = (df['first'] == 'Nazmul') |  (df['last'] == 'Hasan')

In [64]:
type(df['last'] == 'Hasan')

pandas.core.series.Series

In [65]:
df.loc[~filt,'email']

1    rezwanulkarim@gmail.com
Name: email, dtype: object

In [66]:
df.head()

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam    nazmulaloam@gmail.com

In [67]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [68]:
df.columns = ['first_name','last_name','email']

In [69]:
df

  first_name last_name                    email
0     Kamrul     Hasan    kamrulhasan@gmail.com
1     Rezwan     karim  rezwanulkarim@gmail.com
2     Nazmul      Alam    nazmulaloam@gmail.com

In [70]:
df.columns = [x.upper()for x in df.columns]

In [71]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0     Kamrul     Hasan    kamrulhasan@gmail.com
1     Rezwan     karim  rezwanulkarim@gmail.com
2     Nazmul      Alam    nazmulaloam@gmail.com

In [72]:
df.columns = df.columns.str.replace('_', ' ')

In [73]:
df

  FIRST NAME LAST NAME                    EMAIL
0     Kamrul     Hasan    kamrulhasan@gmail.com
1     Rezwan     karim  rezwanulkarim@gmail.com
2     Nazmul      Alam    nazmulaloam@gmail.com

In [74]:
df.columns = df.columns.str.replace(' ', '_')

In [75]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0     Kamrul     Hasan    kamrulhasan@gmail.com
1     Rezwan     karim  rezwanulkarim@gmail.com
2     Nazmul      Alam    nazmulaloam@gmail.com

In [76]:
df.columns = [x.lower() for x in df.columns]

In [77]:
df

  first_name last_name                    email
0     Kamrul     Hasan    kamrulhasan@gmail.com
1     Rezwan     karim  rezwanulkarim@gmail.com
2     Nazmul      Alam    nazmulaloam@gmail.com

In [78]:
columns = {
    'first_name':'first',
    'last_name':'last'
}

In [79]:
df.rename({
    'first_name':'first',
    'last_name':'last'
}, inplace = True)

In [80]:
df

  first_name last_name                    email
0     Kamrul     Hasan    kamrulhasan@gmail.com
1     Rezwan     karim  rezwanulkarim@gmail.com
2     Nazmul      Alam    nazmulaloam@gmail.com

In [81]:
df.rename(columns = columns, inplace = True)

In [82]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam    nazmulaloam@gmail.com

In [83]:
df.loc[2] = ['John','Smith','johnsmith@gmail.com']

In [84]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2    John  Smith      johnsmith@gmail.com

In [85]:
df.loc[2, ['first','last','email']] = ['Nazmul','Alam', 'nazmulalam@gmail.com']

In [86]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam     nazmulalam@gmail.com

In [87]:
df.loc[2, 'last'] = 'Smith'

In [88]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul  Smith     nazmulalam@gmail.com

In [89]:
df.at[2, 'last'] = 'Alam'

In [90]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam     nazmulalam@gmail.com

In [91]:
filt = df['email']=='nazmulalam@gmail.com'

df.loc[filt,'last'] = 'Alam'

In [92]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam     nazmulalam@gmail.com

In [93]:
 df['email']= df['email'].str.upper()

In [94]:
df

    first   last                    email
0  Kamrul  Hasan    KAMRULHASAN@GMAIL.COM
1  Rezwan  karim  REZWANULKARIM@GMAIL.COM
2  Nazmul   Alam     NAZMULALAM@GMAIL.COM

In [95]:
#apply
#map
#applymap
#replace

In [96]:
def update(email):
    return email.upper()

In [97]:
df['email'] = df['email'].apply(update)

In [98]:
df

    first   last                    email
0  Kamrul  Hasan    KAMRULHASAN@GMAIL.COM
1  Rezwan  karim  REZWANULKARIM@GMAIL.COM
2  Nazmul   Alam     NAZMULALAM@GMAIL.COM

In [99]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [100]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam     nazmulalam@gmail.com

In [101]:
 df.apply(len)

first    3
last     3
email    3
dtype: int64

In [102]:
df

    first   last                    email
0  Kamrul  Hasan    kamrulhasan@gmail.com
1  Rezwan  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam     nazmulalam@gmail.com

In [103]:
df['email'].apply(len)

0    21
1    23
2    20
Name: email, dtype: int64

In [104]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [105]:
df.apply(lambda x: x.min())

first                   Kamrul
last                      Alam
email    kamrulhasan@gmail.com
dtype: object

In [106]:
df.applymap(max)

  first last email
0     u    s     u
1     z    r     z
2     z    m     z

In [107]:
df.applymap(str.lower)

    first   last                    email
0  kamrul  hasan    kamrulhasan@gmail.com
1  rezwan  karim  rezwanulkarim@gmail.com
2  nazmul   alam     nazmulalam@gmail.com

In [108]:
df['first'].replace({'Kamrul':'Hasan','Rezwan':'Alam'}, inplace=True)

In [109]:
df

    first   last                    email
0   Hasan  Hasan    kamrulhasan@gmail.com
1    Alam  karim  rezwanulkarim@gmail.com
2  Nazmul   Alam     nazmulalam@gmail.com

In [110]:
df['full_name']= df['first']+' '+df['last']

In [111]:
df

    first   last                    email    full_name
0   Hasan  Hasan    kamrulhasan@gmail.com  Hasan Hasan
1    Alam  karim  rezwanulkarim@gmail.com   Alam karim
2  Nazmul   Alam     nazmulalam@gmail.com  Nazmul Alam

In [112]:
df.drop(columns=['first','last'],inplace = True)

In [113]:
df

                     email    full_name
0    kamrulhasan@gmail.com  Hasan Hasan
1  rezwanulkarim@gmail.com   Alam karim
2     nazmulalam@gmail.com  Nazmul Alam

In [120]:
df['full_name'].str.split(' ')

0    [Hasan, Hasan]
1     [Alam, karim]
2    [Nazmul, Alam]
Name: full_name, dtype: object

In [121]:
df

                     email    full_name   first   last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan  Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam  karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul   Alam

In [118]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [119]:
df

                     email    full_name   first   last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan  Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam  karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul   Alam

In [125]:
df.append({'first':'Tony','last':'khan','email':'tonykhan@gmail.com','full_name':"Tony Khan"},ignore_index=True)

                     email    full_name   first   last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan  Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam  karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul   Alam
3       tonykhan@gmail.com    Tony Khan    Tony   khan

In [126]:
people = {
    'first' : ['Tony','Steve'],
    'last' : ['Stark','Rogers'],
    'email' : ['tonystark@gmail.com','steverogers@gmail.com']
}

In [127]:
df2 = pd.DataFrame(people)

In [128]:
df2

   first    last                  email
0   Tony   Stark    tonystark@gmail.com
1  Steve  Rogers  steverogers@gmail.com

In [137]:
df = df.append(df2, ignore_index= True)

In [133]:
df

                     email    full_name   first    last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam   karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul    Alam
3      tonystark@gmail.com          NaN    Tony   Stark
4    steverogers@gmail.com          NaN   Steve  Rogers
0      tonystark@gmail.com          NaN    Tony   Stark
1    steverogers@gmail.com          NaN   Steve  Rogers

In [134]:
people = {
    'first' : ['lol','Steve'],
    'last' : ['chol','Rogers'],
    'email' : ['lol@gmail.com','chol@gmail.com']
}

In [135]:
df3 = pd.DataFrame(people)

In [144]:
df.append(df3,ignore_index=True)

                      email    full_name   first    last
0     kamrulhasan@gmail.com  Hasan Hasan   Hasan   Hasan
1   rezwanulkarim@gmail.com   Alam karim    Alam   karim
2      nazmulalam@gmail.com  Nazmul Alam  Nazmul    Alam
3       tonystark@gmail.com          NaN    Tony   Stark
4     steverogers@gmail.com          NaN   Steve  Rogers
5       tonystark@gmail.com          NaN    Tony   Stark
6     steverogers@gmail.com          NaN   Steve  Rogers
7       tonystark@gmail.com          NaN    Tony   Stark
8     steverogers@gmail.com          NaN   Steve  Rogers
9             lol@gmail.com          NaN     lol    chol
10           chol@gmail.com          NaN   Steve  Rogers

In [151]:
df

                     email    full_name   first    last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam   karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul    Alam
3      tonystark@gmail.com          NaN    Tony   Stark
4    steverogers@gmail.com          NaN   Steve  Rogers
5      tonystark@gmail.com          NaN    Tony   Stark
6    steverogers@gmail.com          NaN   Steve  Rogers
7      tonystark@gmail.com          NaN    Tony   Stark
8    steverogers@gmail.com          NaN   Steve  Rogers

In [154]:
df.drop(columns= 'last', index=8)

                     email    full_name   first
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul
3      tonystark@gmail.com          NaN    Tony
4    steverogers@gmail.com          NaN   Steve
5      tonystark@gmail.com          NaN    Tony
6    steverogers@gmail.com          NaN   Steve
7      tonystark@gmail.com          NaN    Tony

In [155]:
df

                     email    full_name   first    last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam   karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul    Alam
3      tonystark@gmail.com          NaN    Tony   Stark
4    steverogers@gmail.com          NaN   Steve  Rogers
5      tonystark@gmail.com          NaN    Tony   Stark
6    steverogers@gmail.com          NaN   Steve  Rogers
7      tonystark@gmail.com          NaN    Tony   Stark
8    steverogers@gmail.com          NaN   Steve  Rogers

In [159]:
df.drop(index=df[df['full_name']=='NaN'].index)

                     email    full_name   first    last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam   karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul    Alam
3      tonystark@gmail.com          NaN    Tony   Stark
4    steverogers@gmail.com          NaN   Steve  Rogers
5      tonystark@gmail.com          NaN    Tony   Stark
6    steverogers@gmail.com          NaN   Steve  Rogers
7      tonystark@gmail.com          NaN    Tony   Stark
8    steverogers@gmail.com          NaN   Steve  Rogers

In [160]:
df.drop(index = df[df['last']=='Alam'].index)

                     email    full_name  first    last
0    kamrulhasan@gmail.com  Hasan Hasan  Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim   Alam   karim
3      tonystark@gmail.com          NaN   Tony   Stark
4    steverogers@gmail.com          NaN  Steve  Rogers
5      tonystark@gmail.com          NaN   Tony   Stark
6    steverogers@gmail.com          NaN  Steve  Rogers
7      tonystark@gmail.com          NaN   Tony   Stark
8    steverogers@gmail.com          NaN  Steve  Rogers

In [161]:
df

                     email    full_name   first    last
0    kamrulhasan@gmail.com  Hasan Hasan   Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim    Alam   karim
2     nazmulalam@gmail.com  Nazmul Alam  Nazmul    Alam
3      tonystark@gmail.com          NaN    Tony   Stark
4    steverogers@gmail.com          NaN   Steve  Rogers
5      tonystark@gmail.com          NaN    Tony   Stark
6    steverogers@gmail.com          NaN   Steve  Rogers
7      tonystark@gmail.com          NaN    Tony   Stark
8    steverogers@gmail.com          NaN   Steve  Rogers

In [162]:
filt = (df['last']=='Alam')
df.drop(index=df[filt].index)

                     email    full_name  first    last
0    kamrulhasan@gmail.com  Hasan Hasan  Hasan   Hasan
1  rezwanulkarim@gmail.com   Alam karim   Alam   karim
3      tonystark@gmail.com          NaN   Tony   Stark
4    steverogers@gmail.com          NaN  Steve  Rogers
5      tonystark@gmail.com          NaN   Tony   Stark
6    steverogers@gmail.com          NaN  Steve  Rogers
7      tonystark@gmail.com          NaN   Tony   Stark
8    steverogers@gmail.com          NaN  Steve  Rogers